In [1]:
import pandas as pd
import numpy as np
from cvxpy.atoms.affine.index import index

In [2]:
df = pd.DataFrame(np.random.rand(3,3))

In [3]:
df

          0         1         2
0  0.685428  0.421594  0.461793
1  0.255925  0.052254  0.204557
2  0.950589  0.378682  0.361467

In [4]:
df = pd.DataFrame(np.random.rand(3,3),columns=['A','B','C'])

In [5]:
df

          A         B         C
0  0.966758  0.656924  0.226691
1  0.536274  0.223268  0.872501
2  0.285995  0.939163  0.672895

In [6]:
df = pd.DataFrame(np.random.rand(3,3),index=['x','y','z'],columns=['A','B','C'])

In [7]:
df

          A         B         C
x  0.547621  0.486250  0.566357
y  0.438709  0.157465  0.609991
z  0.422697  0.179747  0.137424

In [8]:
df.dtypes

A    float64
B    float64
C    float64
dtype: object

In [9]:
df = pd.DataFrame(np.random.rand(3,3),index=['x','y','z'],columns=['A','B','C']).astype({'A':'float32'})

In [10]:
df.dtypes

A    float32
B    float64
C    float64
dtype: object

In [11]:
df1 = pd.read_csv("Employee.csv")

In [12]:
df1

,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
0,Bachelors,2017,Bangalore,3,34,Male,No,0,0
1,Bachelors,2013,Pune,1,28,Female,No,3,1
2,Bachelors,2014,New Delhi,3,38,Female,No,2,0
3,Masters,2016,Bangalore,3,27,Male,No,5,1
4,Masters,2017,Pune,3,24,Male,Yes,2,1
...,...,...,...,...,...,...,...,...,...
4648,Bachelors,2013,Bangalore,3,26,Female,No,4,0
4649,Masters,2013,Pune,2,37,Male,No,2,1
4650,Masters,2018,New Delhi,3,27,Male,No,5,1
4651,Bachelors,2012,Bangalore,3,30,Male,Yes,2,0
4652,Bachelors,2015,Bangalore,3,33,Male,Yes,4,0

In [13]:
df1 = pd.read_csv("Employee.csv" ,header=None)

In [14]:
df1

,0,1,2,3,4,5,6,7,8
0,Education,JoiningYear,City,PaymentTier,Age,Gender,EverBenched,ExperienceInCurrentDomain,LeaveOrNot
1,Bachelors,2017,Bangalore,3,34,Male,No,0,0
2,Bachelors,2013,Pune,1,28,Female,No,3,1
3,Bachelors,2014,New Delhi,3,38,Female,No,2,0
4,Masters,2016,Bangalore,3,27,Male,No,5,1
...,...,...,...,...,...,...,...,...,...
4649,Bachelors,2013,Bangalore,3,26,Female,No,4,0
4650,Masters,2013,Pune,2,37,Male,No,2,1
4651,Masters,2018,New Delhi,3,27,Male,No,5,1
4652,Bachelors,2012,Bangalore,3,30,Male,Yes,2,0
4653,Bachelors,2015,Bangalore,3,33,Male,Yes,4,0

In [15]:
df1.columns

Index([0, 1, 2, 3, 4, 5, 6, 7, 8], dtype='int64')

In [16]:
df1[0]

0       Education
1       Bachelors
2       Bachelors
3       Bachelors
4         Masters
          ...
4649    Bachelors
4650      Masters
4651      Masters
4652    Bachelors
4653    Bachelors
Name: 0, Length: 4654, dtype: object

In [17]:
df1[0][0]

'Education'

In [18]:
df1 = pd.read_csv("Employee.csv" ,header=None ,skiprows=1)

In [19]:
df1

              0     1          2  3   4       5    6  7  8
0     Bachelors  2017  Bangalore  3  34    Male   No  0  0
1     Bachelors  2013       Pune  1  28  Female   No  3  1
2     Bachelors  2014  New Delhi  3  38  Female   No  2  0
3       Masters  2016  Bangalore  3  27    Male   No  5  1
4       Masters  2017       Pune  3  24    Male  Yes  2  1
...         ...   ...        ... ..  ..     ...  ... .. ..
4648  Bachelors  2013  Bangalore  3  26  Female   No  4  0
4649    Masters  2013       Pune  2  37    Male   No  2  1
4650    Masters  2018  New Delhi  3  27    Male   No  5  1
4651  Bachelors  2012  Bangalore  3  30    Male  Yes  2  0
4652  Bachelors  2015  Bangalore  3  33    Male  Yes  4  0

[4653 rows x 9 columns]

In [20]:
df1 = pd.read_csv("Employee.csv" ,header=None ,skiprows=1 , names=['A','B','C' ,'D','E','F','G','H'])

In [21]:
df1

              A          B  C   D       E    F  G  H
Bachelors  2017  Bangalore  3  34    Male   No  0  0
Bachelors  2013       Pune  1  28  Female   No  3  1
Bachelors  2014  New Delhi  3  38  Female   No  2  0
Masters    2016  Bangalore  3  27    Male   No  5  1
Masters    2017       Pune  3  24    Male  Yes  2  1
...         ...        ... ..  ..     ...  ... .. ..
Bachelors  2013  Bangalore  3  26  Female   No  4  0
Masters    2013       Pune  2  37    Male   No  2  1
Masters    2018  New Delhi  3  27    Male   No  5  1
Bachelors  2012  Bangalore  3  30    Male  Yes  2  0
Bachelors  2015  Bangalore  3  33    Male  Yes  4  0

[4653 rows x 8 columns]

In [22]:
df1.columns

Index(['A', 'B', 'C', 'D', 'E', 'F', 'G', 'H'], dtype='object')

In [24]:
df1['A'][1]

C:\Users\ASUS\AppData\Local\Temp\ipykernel_19464\82380462.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df1['A'][1]

np.int64(2013)

In [26]:
df1 = pd.read_csv("Employee.csv" , usecols=['City'])

In [27]:
df1

           City
0     Bangalore
1          Pune
2     New Delhi
3     Bangalore
4          Pune
...         ...
4648  Bangalore
4649       Pune
4650  New Delhi
4651  Bangalore
4652  Bangalore

[4653 rows x 1 columns]

In [30]:
df1 = pd.read_csv("Employee.csv" , usecols=['City' , 'Age' , 'Gender'] , nrows=100 , index_col='City')

In [29]:
df1

           City  Age  Gender
0     Bangalore   34    Male
1          Pune   28  Female
2     New Delhi   38  Female
3     Bangalore   27    Male
4          Pune   24    Male
...         ...  ...     ...
4648  Bangalore   26  Female
4649       Pune   37    Male
4650  New Delhi   27    Male
4651  Bangalore   30    Male
4652  Bangalore   33    Male

[4653 rows x 3 columns]

In [31]:
df1.index

Index(['Bangalore', 'Pune', 'New Delhi', 'Bangalore', 'Pune', 'Bangalore',
       'New Delhi', 'Bangalore', 'Pune', 'New Delhi', 'Bangalore', 'Pune',
       'Pune', 'Bangalore', 'Bangalore', 'Bangalore', 'Bangalore', 'Pune',
       'Pune', 'New Delhi', 'Bangalore', 'New Delhi', 'New Delhi', 'Bangalore',
       'Bangalore', 'Bangalore', 'Bangalore', 'Bangalore', 'Pune', 'New Delhi',
       'New Delhi', 'Bangalore', 'Bangalore', 'Bangalore', 'Pune', 'Bangalore',
       'New Delhi', 'New Delhi', 'Pune', 'Pune', 'Bangalore', 'New Delhi',
       'Bangalore', 'Bangalore', 'Pune', 'Bangalore', 'New Delhi', 'New Delhi',
       'New Delhi', 'Bangalore', 'New Delhi', 'Pune', 'Bangalore', 'Bangalore',
       'New Delhi', 'New Delhi', 'Bangalore', 'Pune', 'Pune', 'Pune',
       'New Delhi', 'Bangalore', 'Bangalore', 'Pune', 'Bangalore', 'Bangalore',
       'Bangalore', 'New Delhi', 'Bangalore', 'Bangalore', 'Bangalore',
       'Bangalore', 'Pune', 'Bangalore', 'New Delhi', 'Bangalore', 'Bangalore',
       'Bangalore', 'Bangalore', 'New Delhi', 'Pune', 'Bangalore', 'Bangalore',
       'Bangalore', 'Bangalore', 'Pune', 'Pune', 'Pune', 'Bangalore',
       'New Delhi', 'Bangalore', 'New Delhi', 'New Delhi', 'New Delhi',
       'Bangalore', 'Bangalore', 'Bangalore', 'Bangalore', 'Bangalore',
       'Bangalore'],
      dtype='object', name='City')

In [32]:
df1

           Age  Gender
City
Bangalore   34    Male
Pune        28  Female
New Delhi   38  Female
Bangalore   27    Male
Pune        24    Male
...        ...     ...
Bangalore   26    Male
Bangalore   31  Female
Bangalore   27    Male
Bangalore   29  Female
Bangalore   24  Female

[100 rows x 2 columns]

In [33]:
df1.dtypes

Age        int64
Gender    object
dtype: object